ruby/sample_app/app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "タイトル"], ["body", "ああああ"], ["created_at", "2022-03-05 07:17:50.734047"], ["updated_at", "2022-03-05 07:17:50.734047"]]
---
  def create
    list = List.new(list_params)
    # DBに保存
    list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "タイトル編集"], ["updated_at", "2022-03-05 23:52:30.507096"], ["id", 1]]
---
  def update
    list = List.find(params[:id])
    list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 5]]
---
  def destroy
    list = List.find(params[:id])
    list.destroy